---
kind: other
id: Properties.T:Autodesk.Revit.DB.HostedSweep
source: html/23d83c04-b905-4bc6-ae91-a48478552a6e.htm
---
# HostedSweep Properties

Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).